pteid-mw-pt/_src/eidmw-branch/scap-client-v2/ACService/AttributeClientServiceBinding.Attributes.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#"
  xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
  xmlns:wsc="http://docs.oasis-open.org/ws-sx/ws-secureconversation/200512"
  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
  xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
  xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
  xmlns:ns4="http://www.cartaodecidadao.pt/ccc/commons/messages/Types"
  xmlns:ns3="http://www.cartaodecidadao.pt/ccc/commons/messages/Attribute"
  xmlns:ns1="http://www.cartaodecidadao.pt/ccc/sccc/services/AttributeClientService"
  xmlns:ns2="http://www.cartaodecidadao.pt/ccc/sccc/messages/AttributeClientService">
 <SOAP-ENV:Header>
 </SOAP-ENV:Header>
 <SOAP-ENV:Body>
   <ns2:AttributeRequest>
    <ns2:ProcessId></ns2:ProcessId>
    <ns2:Citizen>
     <ns3:Name></ns3:Name>
     <ns3:NIC></ns3:NIC>
     <ns3:ExtraIDList>
      <ns3:ExtraID>
       <ns3:Name></ns3:Name>
       <ns3:Value></ns3:Value>
      </ns3:ExtraID>
     </ns3:ExtraIDList>
    </ns2:Citizen>
    <ns2:AttributeSuppliers>
     <ns2:AttributeSupplier>
      <ns3:Id></ns3:Id>
      <ns3:Name></ns3:Name>
     </ns2:AttributeSupplier>
    </ns2:AttributeSuppliers>
   </ns2:AttributeRequest>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
